docker-final/docker-mariadb/context/lasttest/mariadb_stresstest_read.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 20 tps: 1404.43 qps: 22513.11 (r/w/o: 19700.24/0.00/2812.86) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 20 tps: 1391.47 qps: 22262.16 (r/w/o: 19479.41/0.00/2782.74) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 20 tps: 1370.38 qps: 21928.23 (r/w/o: 19187.48/0.00/2740.75) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 1314.81 qps: 21031.73 (r/w/o: 18401.91/0.00/2629.82) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 20 tps: 1398.08 qps: 22373.34 (r/w/o: 19577.17/0.00/2796.17) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 1407.51 qps: 22526.01 (r/w/o: 19710.99/0.00/2815.03) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            580384
        write:                           0
        other:                           82912
        total:                           663296
    transactions:                        41456  (1380.96 per sec.)
    queries:                             663296 (22095.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0184s
    total number of events:              41456

Latency (ms):
         min:                                    1.97
         avg:                                   14.47
         max:                                  144.47
         95th percentile:                       23.95
         sum:                               599983.55

Threads fairness:
    events (avg/stddev):           2072.8000/64.97
    execution time (avg/stddev):   29.9992/0.01