docker-final/docker-mariadb/context/lasttest/mariadb_stresstest_read.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 20 tps: 1305.34 qps: 20928.61 (r/w/o: 18313.93/0.00/2614.68) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 20 tps: 1278.44 qps: 20450.57 (r/w/o: 17893.90/0.00/2556.67) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 20 tps: 887.53 qps: 14194.25 (r/w/o: 12419.39/0.00/1774.86) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 1138.89 qps: 18238.61 (r/w/o: 15960.43/0.00/2278.18) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00

[ 25s ] thds: 20 tps: 1149.72 qps: 18388.38 (r/w/o: 16088.93/0.00/2299.45) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 1178.52 qps: 18859.90 (r/w/o: 16502.86/0.00/2357.04) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            486024
        write:                           0
        other:                           69432
        total:                           555456
    transactions:                        34716  (1156.43 per sec.)
    queries:                             555456 (18502.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0185s
    total number of events:              34716

Latency (ms):
         min:                                    2.28
         avg:                                   17.28
         max:                                  217.96
         95th percentile:                       34.33
         sum:                               600029.02

Threads fairness:
    events (avg/stddev):           1735.8000/78.10
    execution time (avg/stddev):   30.0015/0.01