docker-final/docker-mariadb/context/lasttest/mariadb_stresstest_write.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 20 tps: 2297.96 qps: 13803.14 (r/w/o: 0.00/9203.83/4599.31) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 20 tps: 2308.35 qps: 13851.69 (r/w/o: 0.00/9234.20/4617.50) lat (ms,95%): 17.63 err/s: 0.20 reconn/s: 0.00
[ 15s ] thds: 20 tps: 2328.48 qps: 13974.48 (r/w/o: 0.00/9317.52/4656.96) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 2290.38 qps: 13730.85 (r/w/o: 0.00/9150.10/4580.75) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 20 tps: 1976.24 qps: 11868.66 (r/w/o: 0.00/7916.17/3952.49) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 2485.95 qps: 14908.50 (r/w/o: 0.00/9937.40/4971.10) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           273858
        other:                           136929
        total:                           410787
    transactions:                        68464  (2271.96 per sec.)
    queries:                             410787 (13631.84 per sec.)
    ignored errors:                      1      (0.03 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.1328s
    total number of events:              68464

Latency (ms):
         min:                                    1.74
         avg:                                    8.79
         max:                                  199.20
         95th percentile:                       17.95
         sum:                               601482.94

Threads fairness:
    events (avg/stddev):           3423.2000/27.76
    execution time (avg/stddev):   30.0741/0.05